{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "dtype": "float32", "name": "tensorflow_conv1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 48, 48, 3], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "filters": 100, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "tensorflow_pool1", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "bias_regularizer": null, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "tensorflow_conv2", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [4, 4], "filters": 150, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "tensorflow_pool2", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "dtype": "float32", "name": "tensorflow_conv3", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "data_format": "channels_last", "batch_input_shape": [null, 48, 48, 3], "padding": "valid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_size": [3, 3], "filters": 250, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "tensorflow_pool3", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "tensorflow_flatten", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "bias_constraint": null, "name": "tensorflow_fc1", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "units": 200, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "activity_regularizer": null, "bias_constraint": null, "name": "tensorflow_fc2", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "units": 43, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "trainable": true}}], "backend": "tensorflow"}