{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "tensorflow_conv1", "dtype": "float32", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 100, "batch_input_shape": [null, 48, 48, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "tensorflow_pool1", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "tensorflow_conv2", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 150, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_size": [4, 4]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "tensorflow_pool2", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "tensorflow_conv3", "dtype": "float32", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "filters": 250, "batch_input_shape": [null, 48, 48, 3], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "tensorflow_pool3", "data_format": "channels_last", "trainable": true, "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "tensorflow_flatten", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "tensorflow_fc1", "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 200, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "tensorflow_fc2", "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 43, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null}}]}