{"keras_version": "2.1.1", "backend": "tensorflow", "config": [{"config": {"batch_input_shape": [null, 48, 48, 3], "trainable": true, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 100, "strides": [1, 1], "activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "name": "tensorflow_conv1", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "use_bias": true, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "tensorflow_pool1", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 150, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "tensorflow_conv2", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "padding": "valid", "kernel_size": [4, 4]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "tensorflow_pool2", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "bias_constraint": null, "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 250, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "name": "tensorflow_conv3", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "padding": "valid", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "name": "tensorflow_pool3", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "tensorflow_flatten"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 200, "kernel_regularizer": null, "name": "tensorflow_fc1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 43, "kernel_regularizer": null, "name": "tensorflow_fc2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}